{
  "user1": [
    "[bot] Shall we...contract?",
    "[user1] When will the private preview happen?",
    "[bot] The private preview is scheduled for Phase 2, beginning in January 2027. This phase will last approximately 3 months and involve selected OpenGov customers testing the new contract system.",
    "[user1] What are the key deliverables for Phase 3?",
    "[bot] Phase 3 (April 2027 - June 2027) focuses on the public beta. Key deliverables include full feature parity with existing systems, comprehensive testing with a broader user base, performance optimization, and preparation for the full launch in Phase 4."
  ],
  "user2": [
    "[bot] Shall we...contract?",
    "[user2] What happens during the transition phase?",
    "[bot] The Transition phase (July 2027 onwards) involves the full launch of the new contract system. All OpenGov customers will be migrated to the new platform, legacy systems will be phased out, and ongoing support and maintenance will be provided."
  ],
  "user3": [
    "[bot] Shall we...contract?",
    "[user3] Tell me about the prototype development timeline",
    "[bot] Prototype development occurs in Phase 1 (October 2026 - December 2026). During this 3-month period, the team will build the core contract interface, develop the AI assistance features, create the redlining experience, and conduct internal testing before moving to private preview.",
    "[user3] What AI features are included?",
    "[bot] The AI-powered features include intelligent contract analysis, automated redlining suggestions, clause recommendations based on best practices, and natural language processing to help users understand complex legal terms. The AI will assist throughout the entire contract lifecycle."
  ],
  "user4": [
    "[bot] Shall we...contract?",
    "[user4] What are OpenGov's responsibilities in this agreement?",
    "[bot] OpenGov is responsible for providing the technical infrastructure, development resources, user feedback from their customer base, and integration with existing OpenGov systems. They'll also handle customer communications and provide ongoing support during the transition."
  ],
  "user5": [
    "[bot] Shall we...contract?",
    "[user5] How long is the entire project timeline?",
    "[bot] The entire project spans approximately 9 months from start to full transition. It begins with prototype development in October 2026, moves through private preview in January 2027, public beta in April 2027, and culminates in the full transition starting July 2027."
  ]
}
